Revit 2026 API

# FilteredElementCollectorOfCategoryId Method

---

Applies an ElementCategoryFilter to the collector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredElementCollector OfCategoryId(
	ElementId categoryId
)
```
```vb
Public Function OfCategoryId (
	categoryId As ElementId
) As FilteredElementCollector
```
```cpp
public:
FilteredElementCollector^ OfCategoryId(
	ElementId^ categoryId
)
```
```fsharp
member OfCategoryId :
        categoryId : ElementId -> FilteredElementCollector
```

#### Parameters

categoryId ElementId
     The category id.

#### Return Value

FilteredElementCollector A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Only elements of this category id will pass the collector. If you have an active iterator to this collector it will be stopped by this call.

#### Reference

FilteredElementCollector Class

Autodesk.Revit.DB Namespace